
const About = () => {



    
    return(<>
    
   
<div className='section-one'  >
<div className="web-summary">

<h3>درباره لورم ایپسوم</h3>
<br/>
<div className="text"> 
    <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه.</p>
    </div>

</div>

</div>
{/*section one*/}

    
    
    </>)
}




export default About;